wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_syscfg.h
/*!
\file    gd32h77x_syscfg.h
\brief   definitions for the SYSCFG

\version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_SYSCFG_H
#define GD32H77X_SYSCFG_H

#include "gd32h77x.h"

/* SYSCFG definitions */
#define SYSCFG                              SYSCFG_BASE                                 /*!< SYSCFG base address */

/* registers definitions */
#define SYSCFG_PMCFG                        REG32(SYSCFG + 0x00000004U)                 /*!< SYSCFG peripheral mode configuration register */
#define SYSCFG_EXTISS0                      REG32(SYSCFG + 0x00000008U)                 /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                      REG32(SYSCFG + 0x0000000CU)                 /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                      REG32(SYSCFG + 0x00000010U)                 /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                      REG32(SYSCFG + 0x00000014U)                 /*!< EXTI sources selection register 3 */
#define SYSCFG_LKCTL                        REG32(SYSCFG + 0x00000018U)                 /*!< SYSCFG lock control register */
#define SYSCFG_BUSTO                        REG32(SYSCFG + 0x0000001CU)                 /*!< Bus timeout enable control */
#define SYSCFG_CPSCTL                       REG32(SYSCFG + 0x00000020U)                 /*!< I/O compensation control register */
#define SYSCFG_CPSCCCFG                     REG32(SYSCFG + 0x00000028U)                 /*!< I/O compensation cell code configuration */
#define SYSCFG_TIMERCISEL0                  REG32(SYSCFG + 0x00000034U)                 /*!< Timer input selection register 0 */
#define SYSCFG_TIMERCISEL1                  REG32(SYSCFG + 0x00000038U)                 /*!< Timer input selection register 1 */
#define SYSCFG_TIMERCISEL3                  REG32(SYSCFG + 0x00000040U)                 /*!< Timer input selection register 3 */
#define SYSCFG_TIMERCISEL4                  REG32(SYSCFG + 0x00000044U)                 /*!< Timer input selection register 4 */
#define SYSCFG_TIMERCISEL5                  REG32(SYSCFG + 0x00000048U)                 /*!< Timer input selection register 5 */
#define SYSCFG_TIMERCISEL6                  REG32(SYSCFG + 0x0000004CU)                 /*!< Timer input selection register 6 */
#define SYSCFG_CPUICAC                      REG32(SYSCFG + 0x00000054U)                 /*!< CPU icache error status register */
#define SYSCFG_CPUDCAC                      REG32(SYSCFG + 0x00000058U)                 /*!< CPU dcache error status register */
#define SYSCFG_CFPUINTEN                    REG32(SYSCFG + 0x0000005CU)                 /*!< CACHE and FPU interrupt enable register */
#define SYSCFG_SRAMCFG0                     REG32(SYSCFG + 0x00000064U)                 /*!< SRAM configuration register 0*/
#define SYSCFG_BUSTOSTAT                    REG32(SYSCFG + 0x00000068U)                 /*!< Bus timeout status register */
#define SYSCFG_ESCCFG0                      REG32(SYSCFG + 0x0000006CU)                 /*!< ESC configuration register 0 */
#define SYSCFG_ESCCFG1                      REG32(SYSCFG + 0x00000070U)                 /*!< ESC configuration register 1 */
#define SYSCFG_ESCCFG2                      REG32(SYSCFG + 0x00000074U)                 /*!< ESC configuration register 2 */
#define SYSCFG_TIMER0TRGCFG0                REG32(SYSCFG + 0x00000100U)                 /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER0TRGCFG1                REG32(SYSCFG + 0x00000104U)                 /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER0TRGCFG2                REG32(SYSCFG + 0x00000108U)                 /*!< Timer0 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG0                REG32(SYSCFG + 0x0000010CU)                 /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG1                REG32(SYSCFG + 0x00000110U)                 /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER1TRGCFG2                REG32(SYSCFG + 0x00000114U)                 /*!< Timer1 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG0                REG32(SYSCFG + 0x00000118U)                 /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG1                REG32(SYSCFG + 0x0000011CU)                 /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER2TRGCFG2                REG32(SYSCFG + 0x00000120U)                 /*!< Timer2 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG0                REG32(SYSCFG + 0x00000124U)                 /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG1                REG32(SYSCFG + 0x00000128U)                 /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER3TRGCFG2                REG32(SYSCFG + 0x0000012CU)                 /*!< Timer3 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG0                REG32(SYSCFG + 0x00000130U)                 /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG1                REG32(SYSCFG + 0x00000134U)                 /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER4TRGCFG2                REG32(SYSCFG + 0x00000138U)                 /*!< Timer4 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG0                REG32(SYSCFG + 0x0000013CU)                 /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG1                REG32(SYSCFG + 0x00000140U)                 /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER7TRGCFG2                REG32(SYSCFG + 0x00000144U)                 /*!< Timer7 TRG configuration register */
#define SYSCFG_TIMER14TRGCFG0               REG32(SYSCFG + 0x00000148U)                 /*!< Timer14 TRG configuration register */
#define SYSCFG_TIMER14TRGCFG1               REG32(SYSCFG + 0x0000014CU)                 /*!< Timer14 TRG configuration register */
#define SYSCFG_TIMER14TRGCFG2               REG32(SYSCFG + 0x00000150U)                 /*!< Timer14 TRG configuration register */
#define SYSCFG_TIMER22TRGCFG0               REG32(SYSCFG + 0x00000154U)                 /*!< Timer22 TRG configuration register */
#define SYSCFG_TIMER22TRGCFG1               REG32(SYSCFG + 0x00000158U)                 /*!< Timer22 TRG configuration register */
#define SYSCFG_TIMER22TRGCFG2               REG32(SYSCFG + 0x0000015CU)                 /*!< Timer22 TRG configuration register */
#define SYSCFG_TIMER23TRGCFG0               REG32(SYSCFG + 0x00000160U)                 /*!< Timer23 TRG configuration register */
#define SYSCFG_TIMER23TRGCFG1               REG32(SYSCFG + 0x00000164U)                 /*!< Timer23 TRG configuration register */
#define SYSCFG_TIMER23TRGCFG2               REG32(SYSCFG + 0x00000168U)                 /*!< Timer23 TRG configuration register */
#define SYSCFG_TIMER30TRGCFG0               REG32(SYSCFG + 0x0000016CU)                 /*!< Timer30 TRG configuration register */
#define SYSCFG_TIMER30TRGCFG1               REG32(SYSCFG + 0x00000170U)                 /*!< Timer30 TRG configuration register */
#define SYSCFG_TIMER30TRGCFG2               REG32(SYSCFG + 0x00000174U)                 /*!< Timer30 TRG configuration register */
#define SYSCFG_TIMER31TRGCFG0               REG32(SYSCFG + 0x00000178U)                 /*!< Timer31 TRG configuration register */
#define SYSCFG_TIMER31TRGCFG1               REG32(SYSCFG + 0x0000017CU)                 /*!< Timer31 TRG configuration register */
#define SYSCFG_TIMER31TRGCFG2               REG32(SYSCFG + 0x00000180U)                 /*!< Timer31 TRG configuration register */
#define SYSCFG_TIMER40TRGCFG0               REG32(SYSCFG + 0x00000184U)                 /*!< Timer40 TRG configuration register */
#define SYSCFG_TIMER40TRGCFG1               REG32(SYSCFG + 0x00000188U)                 /*!< Timer40 TRG configuration register */
#define SYSCFG_TIMER40TRGCFG2               REG32(SYSCFG + 0x0000018CU)                 /*!< Timer40 TRG configuration register */
#define SYSCFG_TIMER41TRGCFG0               REG32(SYSCFG + 0x00000190U)                 /*!< Timer41 TRG configuration register */
#define SYSCFG_TIMER41TRGCFG1               REG32(SYSCFG + 0x00000194U)                 /*!< Timer41 TRG configuration register */
#define SYSCFG_TIMER41TRGCFG2               REG32(SYSCFG + 0x00000198U)                 /*!< Timer41 TRG configuration register */
#define SYSCFG_TIMER42TRGCFG0               REG32(SYSCFG + 0x0000019CU)                 /*!< Timer42 TRG configuration register */
#define SYSCFG_TIMER42TRGCFG1               REG32(SYSCFG + 0x000001A0U)                 /*!< Timer42 TRG configuration register */
#define SYSCFG_TIMER42TRGCFG2               REG32(SYSCFG + 0x000001A4U)                 /*!< Timer42 TRG configuration register */
#define SYSCFG_TIMER43TRGCFG0               REG32(SYSCFG + 0x000001A8U)                 /*!< Timer43 TRG configuration register */
#define SYSCFG_TIMER43TRGCFG1               REG32(SYSCFG + 0x000001ACU)                 /*!< Timer43 TRG configuration register */
#define SYSCFG_TIMER43TRGCFG2               REG32(SYSCFG + 0x000001B0U)                 /*!< Timer43 TRG configuration register */
#define SYSCFG_TIMER44TRGCFG0               REG32(SYSCFG + 0x000001B4U)                 /*!< Timer44 TRG configuration register */
#define SYSCFG_TIMER44TRGCFG1               REG32(SYSCFG + 0x000001B8U)                 /*!< Timer44 TRG configuration register */
#define SYSCFG_TIMER44TRGCFG2               REG32(SYSCFG + 0x000001BCU)                 /*!< Timer44 TRG configuration register */
#define SYSCFG_USERCFG                      REG32(SYSCFG + 0x00000300U)                 /*!< User configuration register */

/* SYSCFG_PMCFG bits definitions */
#define SYSCFG_PMCFG_I2C0FMPEN              BIT(0)                                      /*!< I2C0 fast mode plus enable */
#define SYSCFG_PMCFG_I2C1FMPEN              BIT(1)                                      /*!< I2C1 fast mode plus enable */
#define SYSCFG_PMCFG_I2C2FMPEN              BIT(2)                                      /*!< I2C2 fast mode plus enable */
#define SYSCFG_PMCFG_I2C3FMPEN              BIT(3)                                      /*!< I2C3 fast mode plus enable */
#define SYSCFG_PMCFG_PB6FMPEN               BIT(4)                                      /*!< I2C fast mode plus on PB6 pin enable */
#define SYSCFG_PMCFG_PB7FMPEN               BIT(5)                                      /*!< I2C fast mode plus on PB7 pin enable */
#define SYSCFG_PMCFG_PB8FMPEN               BIT(6)                                      /*!< I2C fast mode plus on PB8 pin enable */
#define SYSCFG_PMCFG_PB9FMPEN               BIT(7)                                      /*!< I2C fast mode plus on PB9 pin enable */
#define SYSCFG_PMCFG_ENET1_PHY_SEL          BIT(22)                                     /*!< Ethernet1 PHY interface selection */
#define SYSCFG_PMCFG_ENET0_PHY_SEL          BIT(23)                                     /*!< Ethernet0 PHY interface selection */
#define SYSCFG_PMCFG_PA0SWON                BIT(24)                                     /*!< PA0 switch open */
#define SYSCFG_PMCFG_PA1SWON                BIT(25)                                     /*!< PA1 switch open */
#define SYSCFG_PMCFG_PC2SWON                BIT(26)                                     /*!< PC2 switch open */
#define SYSCFG_PMCFG_PC3SWON                BIT(27)                                     /*!< PC3 switch open */
#define SYSCFG_PMCFG_IO_SEL                 BITS(28,30)                                 /*!< Coder IO select */

