wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_syscfg.h
/* SYSCFG_EXTISS0 bits definitions */
#define SYSCFG_EXTISS0_EXTI0_SS             BITS(0,3)                                   /*!< EXTI 0 configuration */
#define SYSCFG_EXTISS0_EXTI1_SS             BITS(4,7)                                   /*!< EXTI 1 configuration */
#define SYSCFG_EXTISS0_EXTI2_SS             BITS(8,11)                                  /*!< EXTI 2 configuration */
#define SYSCFG_EXTISS0_EXTI3_SS             BITS(12,15)                                 /*!< EXTI 3 configuration */

/* SYSCFG_EXTISS1 bits definitions */
#define SYSCFG_EXTISS1_EXTI4_SS             BITS(0,3)                                   /*!< EXTI 4 configuration */
#define SYSCFG_EXTISS1_EXTI5_SS             BITS(4,7)                                   /*!< EXTI 5 configuration */
#define SYSCFG_EXTISS1_EXTI6_SS             BITS(8,11)                                  /*!< EXTI 6 configuration */
#define SYSCFG_EXTISS1_EXTI7_SS             BITS(12,15)                                 /*!< EXTI 7 configuration */

/* SYSCFG_EXTISS2 bits definitions */
#define SYSCFG_EXTISS2_EXTI8_SS             BITS(0,3)                                   /*!< EXTI 8 configuration */
#define SYSCFG_EXTISS2_EXTI9_SS             BITS(4,7)                                   /*!< EXTI 9 configuration */
#define SYSCFG_EXTISS2_EXTI10_SS            BITS(8,11)                                  /*!< EXTI 10 configuration */
#define SYSCFG_EXTISS2_EXTI11_SS            BITS(12,15)                                 /*!< EXTI 11 configuration */

/* SYSCFG_EXTISS3 bits definitions */
#define SYSCFG_EXTISS3_EXTI12_SS            BITS(0,3)                                   /*!< EXTI 12 configuration */
#define SYSCFG_EXTISS3_EXTI13_SS            BITS(4,7)                                   /*!< EXTI 13 configuration */
#define SYSCFG_EXTISS3_EXTI14_SS            BITS(8,11)                                  /*!< EXTI 14 configuration */
#define SYSCFG_EXTISS3_EXTI15_SS            BITS(12,15)                                 /*!< EXTI 15 configuration */

/* SYSCFG_LKCTL bits definitions */
#define SYSCFG_LKCTL_LVD_LOCK               BIT(2)                                      /*!< programmable voltage detector lockup */
#define SYSCFG_LKCTL_CPU_LOCK               BIT(6)                                      /*!< CPU lockup */
#define SYSCFG_LKCTL_BKPRAM_LOCK            BIT(7)                                      /*!< Region 2 backup SRAM ECC double error lockup */
#define SYSCFG_LKCTL_SRAM1_LOCK             BIT(11)                                     /*!< Region 1 SRAM1 ECC double error lockup */
#define SYSCFG_LKCTL_SRAM0_LOCK             BIT(12)                                     /*!< Region 1 SRAM0 ECC double error lockup */
#define SYSCFG_LKCTL_DTCM_LOCK              BIT(13)                                     /*!< Region 0 DTCM ECC double error lock */
#define SYSCFG_LKCTL_ITCM_LOCK              BIT(14)                                     /*!< Region 0 ITCM-RAM ECC double error lock */
#define SYSCFG_LKCTL_AXIRAM_LOCK            BIT(15)                                     /*!< Region 0 AXI-SRAM ECC double error lock */

/* Bus Timeout bits definitions */
#define SYSCFG_BUSTO_SDIO0BUS               BIT(0)                                      /*!< SDIO0 BUS Timeout enable */
#define SYSCFG_BUSTO_CPUBUS                 BIT(1)                                      /*!< CPU BUS Timeout enable */
#define SYSCFG_BUSTO_TLIBUS                 BIT(2)                                      /*!< TLI BUS Timeout enable */
#define SYSCFG_BUSTO_MDMABUS                BIT(3)                                      /*!< MDMA BUS Timeout enable */
#define SYSCFG_BUSTO_IPABUS                 BIT(4)                                      /*!< IPA BUS Timeout enable */
#define SYSCFG_BUSTO_CPUAHBPBUS             BIT(5)                                      /*!< CPU AHBP BUS Timeout enable */
#define SYSCFG_BUSTO_DMA0MEMBUS             BIT(6)                                      /*!< DMA0 mem BUS Timeout enable */
#define SYSCFG_BUSTO_DMA0PERIPHBUS          BIT(7)                                      /*!< DMA0 per BUS Timeout enable */
#define SYSCFG_BUSTO_DMA1MEMBUS             BIT(8)                                      /*!< DMA1 mem BUS Timeout enable */
#define SYSCFG_BUSTO_DMA1PERIPHBUS          BIT(9)                                      /*!< DMA1 per BUS Timeout enable */
#define SYSCFG_BUSTO_ENET0BUS               BIT(10)                                     /*!< ENET0 BUS Timeout enable */
#define SYSCFG_BUSTO_ENET1BUS               BIT(11)                                     /*!< ENET1 BUS Timeout enable */
#define SYSCFG_BUSTO_SDIO1BUS               BIT(12)                                     /*!< SDIO1 BUS Timeout enable */
#define SYSCFG_BUSTO_USBHS0BUS              BIT(13)                                     /*!< USBHS0 BUS Timeout enable */
#define SYSCFG_BUSTO_USBHS1BUS              BIT(14)                                     /*!< USBHS1 BUS Timeout enable */
#define SYSCFG_BUSTO_FFTBUS                 BIT(15)                                     /*!< FFT BUS Timeout enable */
#define SYSCFG_BUSTO_ESCBUS                 BIT(16)                                     /*!< ETHERCAT BUS Timeout enable */

/* SYSCFG_CPSCTL bits definitions */
#define SYSCFG_CPSCTL_CPS_EN                BIT(0)                                      /*!< I/O compensation cell enable */
#define SYSCFG_CPSCTL_CPS_RDY               BIT(8)                                      /*!< Compensation cell ready flag */
#define SYSCFG_CPSCTL_IOSPDOP               BIT(16)                                     /*!< I/O speed optimization, high-speed at low-voltage */
#define SYSCFG_CPSCTL_IOLV                  BIT(23)                                     /*!< I/O in low voltage state */

/* SYSCFG_CPSCCCFG bits definitions */
#define SYSCFG_CPSCCCFG_NCPSCC              BITS(0,3)                                   /*!< NMOS compensation cell code */
#define SYSCFG_CPSCCCFG_PCPSCC              BITS(4,7)                                   /*!< PMOS compensation cell code */

/* SYSCFG_TIMERCISEL0 bits definitions */
#define SYSCFG_TIMER7_CI0_SEL               BIT(0)                                      /*!< Selects TIMER7_CI0 input */
#define SYSCFG_TIMER0_CI0_SEL               BIT(16)                                     /*!< Selects TIMER0_CI0 input */

