wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_syscfg.h
/* SYSCFG_TIMERCISEL1 bits definitions */
#define SYSCFG_TIMER2_CI0_SEL               BITS(0,1)                                   /*!< Selects TIMER2_CI0 input */
#define SYSCFG_TIMER1_CI3_SEL               BITS(28,29)                                 /*!< Selects TIMER1_CI3 input */

/* SYSCFG_TIMERCISEL3 bits definitions */
#define SYSCFG_TIMER22_CI3_SEL              BITS(28,29)                                 /*!< Selects TIMER22_CI3 input */

/* SYSCFG_TIMERCISEL4 bits definitions */
#define SYSCFG_TIMER31_CI0_SEL              BITS(0,1)                                   /*!< Selects TIMER31_CI0 input */
#define SYSCFG_TIMER30_CI0_SEL              BITS(16,17)                                 /*!< Selects TIMER30_CI0 input */

/* SYSCFG_TIMERCISEL5 bits definitions */
#define SYSCFG_TIMER14_CI0_SEL              BITS(0,2)                                   /*!< Selects TIMER14_CI0 input */
#define SYSCFG_TIMER14_CI1_SEL              BITS(4,5)                                   /*!< Selects TIMER14_CI1 input */
#define SYSCFG_TIMER40_CI0_SEL              BITS(8,10)                                  /*!< Selects TIMER40_CI0 input */
#define SYSCFG_TIMER40_CI1_SEL              BITS(12,13)                                 /*!< Selects TIMER40_CI1 input */
#define SYSCFG_TIMER41_CI0_SEL              BITS(16,18)                                 /*!< Selects TIMER41_CI0 input */
#define SYSCFG_TIMER41_CI1_SEL              BITS(20,21)                                 /*!< Selects TIMER41_CI1 input */
#define SYSCFG_TIMER42_CI0_SEL              BITS(24,26)                                 /*!< Selects TIMER42_CI0 input */
#define SYSCFG_TIMER42_CI1_SEL              BITS(28,29)                                 /*!< Selects TIMER42_CI1 input */

/* SYSCFG_TIMERCISEL6 bits definitions */
#define SYSCFG_TIMER15_CI0_SEL              BITS(0,1)                                   /*!< Selects TIMER15_CI0 input */
#define SYSCFG_TIMER16_CI0_SEL              BITS(4,5)                                   /*!< Selects TIMER16_CI0 input */
#define SYSCFG_TIMER43_CI0_SEL              BITS(8,10)                                  /*!< Selects TIMER43_CI0 input */
#define SYSCFG_TIMER43_CI1_SEL              BITS(12,13)                                 /*!< Selects TIMER43_CI1 input */
#define SYSCFG_TIMER44_CI0_SEL              BITS(16,18)                                 /*!< Selects TIMER44_CI0 input */
#define SYSCFG_TIMER44_CI1_SEL              BITS(20,21)                                 /*!< Selects TIMER44_CI1 input */

/* CPU ICACHE error status bits definitions */
#define SYSCFG_CPUICAC_CPU_ICERR            BITS(6,27)                                  /*!< CPU ICACHE error bank information */
#define SYSCFG_CPUICAC_CPU_ICDET            BITS(28,31)                                 /*!< CPU ICACHE error detection information */

/* CPU DCACHE error status bits definitions */
#define SYSCFG_CPUDCAC_CPU_DCERR            BITS(6,27)                                  /*!< CPU DCACHE error bank information */
#define SYSCFG_CPUDCAC_CPU_DCDET            BITS(28,31)                                 /*!< CPU DCACHE error detection information */

/* CACHE and Floating point unit interrupts enable bits */
#define SYSCFG_CFPUINTEN_IOPIE              BIT(0)                                      /*!< Invalid operation Interrupt enable */
#define SYSCFG_CFPUINTEN_DZIE               BIT(1)                                      /*!< Divide-by-zero interrupt enable */
#define SYSCFG_CFPUINTEN_UFIE               BIT(2)                                      /*!< Underflow interrupt enable */
#define SYSCFG_CFPUINTEN_OVFIE              BIT(3)                                      /*!< Overflow interrupt enable */
#define SYSCFG_CFPUINTEN_IDIE               BIT(4)                                      /*!< Input abnormal interrupt enable */
#define SYSCFG_CFPUINTEN_IXIE               BIT(5)                                      /*!< Inexact interrupt enable */
#define SYSCFG_CFPUINTEN_CPU_ICDETIE        BITS(6,9)                                   /*!< CPU ICACHE error detection information int enable */
#define SYSCFG_CFPUINTEN_CPU_DCDETIE        BITS(10,13)                                 /*!< CPU DCACHE error bank information int enable */

/* SRAM configuration register 0 */
#define SYSCFG_SRAMCFG0_SECURE_SRAM_SIZE    BITS(0,1)                                   /*!< size of secure sram */

/* Bus Timeout status definitions */
#define SYSCFG_BUSTOSTAT_SDIO0BUSTOF        BIT(0)                                      /*!< SDIO0 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_CPUBUSTOF          BIT(1)                                      /*!< CPU BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_TLIBUSTOF          BIT(2)                                      /*!< TLI BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_MDMABUSTOF         BIT(3)                                      /*!< MDMA BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_IPABUSTOF          BIT(4)                                      /*!< IPA BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_CPUAHBPBUSTOF      BIT(5)                                      /*!< CPU AHBP BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_DMA0MEMBUSTOF      BIT(6)                                      /*!< DMA0 mem BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_DMA0PERIPHBUSTOF   BIT(7)                                      /*!< DMA0 per BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_DMA1MEMBUSTOF      BIT(8)                                      /*!< DMA1 mem BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_DMA1PERIPHBUSTOF   BIT(9)                                      /*!< DMA1 per BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_ENET0BUSTOF        BIT(10)                                     /*!< ENET0 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_ENET1BUSTOF        BIT(11)                                     /*!< ENET1 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_SDIO1BUSTOF        BIT(12)                                     /*!< SDIO1 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_USBHS0BUSTOF       BIT(13)                                     /*!< USBHS0 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_USBHS1BUSTOF       BIT(14)                                     /*!< USBHS1 BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_FFTBUSTOF          BIT(15)                                     /*!< FFT BUS Timeout flag */
#define SYSCFG_BUSTOSTAT_ESCBUSTOF          BIT(16)                                     /*!< ETHERCAT BUS Timeout flag */

/* EtherCat configuration register 0 */
#define SYSCFG_ESCCFG0_ESC_EEPROM           BIT(0)                                      /*!< EtherCat EEPROM configuration */
#define SYSCFG_ESCCFG0_RMIITX_S0_VAL        BITS(1,2)                                   /*!< EtherCat tx_shift value of RMII SHIFT0 */
#define SYSCFG_ESCCFG0_RMIITX_S1_VAL        BITS(3,4)                                   /*!< EtherCat tx_shift value of RMII SHIFT1 */
#define SYSCFG_ESCCFG0_LINKACTLED0_POLSEL   BIT(7)                                      /*!< EtherCat link_act_led0 signal output active polarity selection */
#define SYSCFG_ESCCFG0_LINKACTLED1_POLSEL   BIT(8)                                      /*!< EtherCat link_act_led1 signal output active polarity selection */
#define SYSCFG_ESCCFG0_LINKACTLED2_POLSEL   BIT(9)                                      /*!< EtherCat link_act_led2 signal output active polarity selection */
#define SYSCFG_ESCCFG0_LEDRUN_POLSEL        BIT(10)                                     /*!< EtherCat led_run signal output active polarity selection */
#define SYSCFG_ESCCFG0_LEDERR_POLSEL        BIT(11)                                     /*!< EtherCat led_err signal output active polarity selection */
#define SYSCFG_ESCCFG0_RMII_S1              BITS(12,14)                                 /*!< EtherCat Clock compensation phase setting in RMII mode */
#define SYSCFG_ESCCFG0_RSTOUT_POLSEL        BIT(15)                                     /*!< EtherCat Reset_out signal output active polarity selection */
#define SYSCFG_ESCCFG0_NLINK0_POLSEL        BIT(16)                                     /*!< EtherCat NLINK0 signal input level polarity selection bits */
#define SYSCFG_ESCCFG0_NLINK1_POLSEL        BIT(17)                                     /*!< EtherCat NLINK1 signal input level polarity selection bits */
#define SYSCFG_ESCCFG0_NLINK2_POLSEL        BIT(18)                                     /*!< EtherCat NLINK2 signal input level polarity selection bits */
#define SYSCFG_ESCCFG0_SHIFTSTEN            BIT(19)                                     /*!< EtherCat Whether to enable the latch function of tx_shift */
#define SYSCFG_ESCCFG0_EEPROMSZ             BIT(20)                                     /*!< EtherCat Internal EEPROM capacity of ESC */
#define SYSCFG_ESCCFG0_PHY_OFFSETSEL        BIT(21)                                     /*!< EtherCat Whether to enable the PHY address offset function of ESC */
#define SYSCFG_ESCCFG0_PHY_OFFSET           BITS(22,26)                                 /*!< EtherCat PHY address offset */
#define SYSCFG_ESCCFG0_RMII_S0              BITS(27,29)                                 /*!< EtherCat Clock compensation phase setting in RMII mode */
#define SYSCFG_ESCCFG0_RMIIEN               BIT(30)                                     /*!< EtherCat RMII port enable */
#define SYSCFG_ESCCFG0_SMPS_DRIVE           BIT(31)                                     /*!< EtherCat SMPS_DRIVE's drive capability */

/* EtherCat configuration register 1 */
#define SYSCFG_ESCCFG1_ESC_SRAM             BITS(0,31)                                  /*!< EtherCat SRAM configuration bits */

