wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_syscfg.h
/* I/O compensation cell enable/disable */
#define SYSCFG_IO_COMPENSATION_ENABLE       ((uint32_t)0x00000001U)                     /*!< I/O compensation cell enable */
#define SYSCFG_IO_COMPENSATION_DISABLE      ((uint32_t)0x00000000U)                     /*!< I/O compensation cell disable */

/* module lockup */
#define SYSCFG_LVD_LOCKUP                   SYSCFG_LKCTL_LVD_LOCK                       /*!< LVD signal connected */
#define SYSCFG_CPU_LOCKUP                   SYSCFG_LKCTL_CPU_LOCK                       /*!< CPU lockup signal connected */
#define SYSCFG_BKPRAM_LOCKUP                SYSCFG_LKCTL_BKPRAM_LOCK                    /*!< Region 2 backup SRAM ECC double error signal connected */
#define SYSCFG_SRAM1_LOCKUP                 SYSCFG_LKCTL_SRAM1_LOCK                     /*!< Region 1 SRAM1 ECC double error signal connected */
#define SYSCFG_SRAM0_LOCKUP                 SYSCFG_LKCTL_SRAM0_LOCK                     /*!< Region 1 SRAM0 ECC double error signal connected */
#define SYSCFG_DTCM_LOCKUP                  SYSCFG_LKCTL_DTCM_LOCK                      /*!< Region 0 DTCM ECC double error signal connected */
#define SYSCFG_ITCM_LOCKUP                  SYSCFG_LKCTL_ITCM_LOCK                      /*!< Region 0 ITCM-RAM ECC double error signal connected */
#define SYSCFG_AXIRAM_LOCKUP                SYSCFG_LKCTL_AXIRAM_LOCK                    /*!< Region 0 AXI-SRAM ECC double error signal connected */

/* SYSCFG compensation flag definitions */
#define SYSCFG_FLAG_IO_LOW_VOLTAGE          SYSCFG_CPSCTL_IOLV                          /*!< I/O in low voltage state flag, product supply voltage is working below 2.5V */
#define SYSCFG_FLAG_COMPENSATION_READY      SYSCFG_CPSCTL_CPS_RDY                       /*!< I/O compensation cell ready flag */

/* SYSCFG interrupt definitions */
#define SYSCFG_INT_INEXACT                  SYSCFG_CFPUINTEN_IXIE                       /*!< inexact interrupt */
#define SYSCFG_INT_INPUT_ABNORMAL           SYSCFG_CFPUINTEN_IDIE                       /*!< input abnormal interrupt */
#define SYSCFG_INT_OVERFLOW                 SYSCFG_CFPUINTEN_OVFIE                      /*!< overflow interrupt */
#define SYSCFG_INT_UNDERFLOW                SYSCFG_CFPUINTEN_UFIE                       /*!< underflow interrupt */
#define SYSCFG_INT_DIV0                     SYSCFG_CFPUINTEN_DZIE                       /*!< divide-by-zero interrupt */
#define SYSCFG_INT_INVALID_OPERATION        SYSCFG_CFPUINTEN_IOPIE                      /*!< invalid operation interrupt */
#define SYSCFG_INT_CPU_DCDET                SYSCFG_CFPUINTEN_CPU_ICDETIE                /*!< CPU ICACHE error detection information interrupt */
#define SYSCFG_INT_CPU_ICDET                SYSCFG_CFPUINTEN_CPU_DCDETIE                /*!< CPU DCACHE error bank information interrupt */

/* BOOT modes definitions */
#define BOOT_SRAM                           ((uint32_t)0x00000000U)                     /*!< BOOT from SRAM (ITCM/DTCM/RAM shared/AXI SRAM) */
#define BOOT_SECURITY                       ((uint32_t)0x00000001U)                     /*!< BOOT from Security */
#define BOOT_SYSTEM                         ((uint32_t)0x00000002U)                     /*!< BOOT_SYS (BootLoader) */
#define BOOT_USER_FLASH                     ((uint32_t)0x00000003U)                     /*!< BOOT_USER (User flash OSPI0/1) */

/* BOR threshold level definitions */
#define BOR_OFF                             ((uint32_t)0x00000000U)                     /*!< no BOR function */
#define BOR_THRESHOLD_VAL1                  ((uint32_t)0x00000001U)                     /*!< BOR threshold value 1 */
#define BOR_THRESHOLD_VAL2                  ((uint32_t)0x00000002U)                     /*!< BOR threshold value 2 */
#define BOR_THRESHOLD_VAL3                  ((uint32_t)0x00000003U)                     /*!< BOR threshold value 3 */

/* EtherCat internal eeprom size polarity select definition */
#define ESC_INTERNAL_EEPROM_SIZE1           ((uint32_t)0x00000000U)                     /*!< Select internal EEPROM size is 1k~15k bit */
#define ESC_INTERNAL_EEPROM_SIZE2           SYSCFG_ESCCFG0_EEPROMSZ                     /*!< Select internal EEPROM size is 16k~4M bit */

/* EtherCat linkactled0 polarity select definition */
#define ESC_LINKACTLED0_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled0 output 0 */
#define ESC_LINKACTLED0_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED0_POLSEL           /*!< EtherCat linkactled0 output 1 */

/* EtherCat linkactled1 polarity select definition */
#define ESC_LINKACTLED1_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled1 output 0 */
#define ESC_LINKACTLED1_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED1_POLSEL           /*!< EtherCat linkactled1 output 1 */

/* EtherCat linkactled2 polarity select definition */
#define ESC_LINKACTLED2_POL_LOW             ((uint32_t)0x00000000U)                     /*!< EtherCat linkactled2 output 0 */
#define ESC_LINKACTLED2_POL_HIGH            SYSCFG_ESCCFG0_LINKACTLED2_POLSEL           /*!< EtherCat linkactled2 output 1 */

/* EtherCat led_err polarity select definition */
#define ESC_LEDERR_POL_LOW                  ((uint32_t)0x00000000U)                     /*!< EtherCat lederr output 0 */
#define ESC_LEDERR_POL_HIGH                 SYSCFG_ESCCFG0_LEDERR_POLSEL                /*!< EtherCat lederr output 1 */

/* EtherCat led_run polarity select definition */
#define ESC_LEDRUN_POL_LOW                  ((uint32_t)0x00000000U)                     /*!< EtherCat ledrun output 0 */
#define ESC_LEDRUN_POL_HIGH                 SYSCFG_ESCCFG0_LEDRUN_POLSEL                /*!< EtherCat ledrun output 1 */

/* EtherCat reset_out polarity select definition */
#define ESC_RSTOUT_POL_HIGH                 ((uint32_t)0x00000000U)                     /*!< EtherCat reset_out output 1 */
#define ESC_RSTOUT_POL_LOW                  SYSCFG_ESCCFG0_RSTOUT_POLSEL                /*!< EtherCat reset_out output 0 */

