wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_syscfg.h
/* EtherCat LINK0 polarity select definition */
#define ESC_LINK0_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK0 output 1 */
#define ESC_LINK0_POL_LOW                   SYSCFG_ESCCFG0_NLINK0_POLSEL                /*!< EtherCat LINK0 output 0 */

/* EtherCat LINK1 polarity select definition */
#define ESC_LINK1_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK1 output 1 */
#define ESC_LINK1_POL_LOW                   SYSCFG_ESCCFG0_NLINK1_POLSEL                /*!< EtherCat LINK1 output 0 */

/* EtherCat LINK2 polarity select definition */
#define ESC_LINK2_POL_HIGH                  ((uint32_t)0x00000000U)                     /*!< EtherCat LINK2 output 1 */
#define ESC_LINK2_POL_LOW                   SYSCFG_ESCCFG0_NLINK2_POLSEL                /*!< EtherCat LINK2 output 0 */

/* EtherCat port0 phy address select definition */
#define ESC_PHY_ADDRESS_OFFSET_0            ((uint32_t)0x00000000U)                     /*!< port0 phy address offset is 0 */
#define ESC_PHY_ADDRESS_OFFSET_16           SYSCFG_ESCCFG0_PHY_OFFSETEN                 /*!< port0 phy address offset is 16 */

/* EtherCat mii or rmii select definition */
#define ESC_MII                             ((uint32_t)0x00000000U)                     /*!< esc mii */
#define ESC_RMII                            SYSCFG_ESCCFG0_RMIIEN                       /*!< esc rmii */

/* EtherCat SMPS_DRIVE's drive capability definition */
#define ESC_SMPS_DRIVE_CAP_NORMAL           ((uint32_t)0x00000000U)                     /*!< Drive capability is normal */
#define ESC_SMPS_DRIVE_CAP_REDUCED          SYSCFG_ESCCFG0_SMPS_DRIVE                   /*!< Drive capability is reduced */

/* rmii0 txshift0 selection */
#define RMII0_TXSHIFT0(regval)              (BITS(1,2)&((uint32_t)(regval)<<1))
#define ESC_RMII0_TXSHIFT0_0NS              RMII0_TXSHIFT0(0)                           /*!< rmii0 txshift value is 0ns */
#define ESC_RMII0_TXSHIFT0_10NS             RMII0_TXSHIFT0(1)                           /*!< rmii0 txshift value is 10ns */
#define ESC_RMII0_TXSHIFT0_20NS             RMII0_TXSHIFT0(2)                           /*!< rmii0 txshift value is 20ns */
#define ESC_RMII0_TXSHIFT0_30NS             RMII0_TXSHIFT0(3)                           /*!< rmii0 txshift value is 30ns */

/* rmii1 txshift1 selection */
#define RMII1_TXSHIFT1(regval)              (BITS(3,4)&((uint32_t)(regval)<<3))
#define ESC_RMII1_TXSHIFT1_0NS              RMII1_TXSHIFT1(0)                           /*!< rmii1 txshift value is 0ns */
#define ESC_RMII1_TXSHIFT1_10NS             RMII1_TXSHIFT1(1)                           /*!< rmii1 txshift value is 10ns */
#define ESC_RMII1_TXSHIFT1_20NS             RMII1_TXSHIFT1(2)                           /*!< rmii1 txshift value is 20ns */
#define ESC_RMII1_TXSHIFT1_30NS             RMII1_TXSHIFT1(3)                           /*!< rmii1 txshift value is 30ns */

/* rmii0 shift0 selection */
#define RMII0_SHIFT0(regval)                (BITS(27,29)&((uint32_t)(regval)<<27))
#define ESC_RMII0_SHIFT0_0                  RMII0_SHIFT0(0)                             /*!< rmii0 phase compensation value is 0ns */
#define ESC_RMII0_SHIFT0_1                  RMII0_SHIFT0(1)                             /*!< rmii0 phase compensation value is 2.5ns */
#define ESC_RMII0_SHIFT0_2                  RMII0_SHIFT0(2)                             /*!< rmii0 phase compensation value is 5ns */
#define ESC_RMII0_SHIFT0_3                  RMII0_SHIFT0(3)                             /*!< rmii0 phase compensation value is 7.5ns */
#define ESC_RMII0_SHIFT0_4                  RMII0_SHIFT0(4)                             /*!< rmii0 phase compensation value is 10ns */
#define ESC_RMII0_SHIFT0_5                  RMII0_SHIFT0(5)                             /*!< rmii0 phase compensation value is 12.5ns */
#define ESC_RMII0_SHIFT0_6                  RMII0_SHIFT0(6)                             /*!< rmii0 phase compensation value is 15ns */
#define ESC_RMII0_SHIFT0_7                  RMII0_SHIFT0(7)                             /*!< rmii0 phase compensation value is 17.5ns */

/* rmii1 shift1 selection */
#define RMII1_SHIFT1(regval)                (BITS(12,14)&((uint32_t)(regval)<<12))
#define ESC_RMII1_SHIFT1_0                  RMII1_SHIFT1(0)                             /*!< rmii1 phase compensation value is 0ns */
#define ESC_RMII1_SHIFT1_1                  RMII1_SHIFT1(1)                             /*!< rmii1 phase compensation value is 2.5ns */
#define ESC_RMII1_SHIFT1_2                  RMII1_SHIFT1(2)                             /*!< rmii1 phase compensation value is 5ns */
#define ESC_RMII1_SHIFT1_3                  RMII1_SHIFT1(3)                             /*!< rmii1 phase compensation value is 7.5ns */
#define ESC_RMII1_SHIFT1_4                  RMII1_SHIFT1(4)                             /*!< rmii1 phase compensation value is 10ns */
#define ESC_RMII1_SHIFT1_5                  RMII1_SHIFT1(5)                             /*!< rmii1 phase compensation value is 12.5ns */
#define ESC_RMII1_SHIFT1_6                  RMII1_SHIFT1(6)                             /*!< rmii1 phase compensation value is 15ns */
#define ESC_RMII1_SHIFT1_7                  RMII1_SHIFT1(7)                             /*!< rmii1 phase compensation value is 17.5ns */

/* port0 phy address value */
#define PHY_ADDRESS_OFFSET(regval)         (BITS(22,26)&((uint32_t)(regval)<<22))


/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);

/* peripheral SYSCFG configuration functions */
/* enable I2Cx(x=0,1,2,3) fast mode plus or I2C fast mode plus PBx(x=6,7,8,9) */
void syscfg_i2c_fast_mode_plus_enable(uint32_t i2c_fmp);
/* disable I2Cx(x=0,1,2,3) fast mode plus or I2C fast mode plus PBx(x=6,7,8,9) */
void syscfg_i2c_fast_mode_plus_disable(uint32_t i2c_fmp);
/* open analog switch (Pxy_C and Pxy are separated pads) */
void syscfg_analog_switch_enable(uint32_t gpio_answ);
/* close analog switch (Pxy_C and Pxy are connected through the analog switch) */
void syscfg_analog_switch_disable(uint32_t gpio_answ);
/* configure the PHY interface for the Ethernet MAC */
void syscfg_enet_phy_interface_config(uint32_t ethernet, uint32_t phy_interface);
/* configure the GPIO pin as EXTI line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);
/* enable module lockup function (function can be disabled by system reset) */
void syscfg_lockup_enable(uint32_t lockup);
/* select timer channel input source */
void syscfg_timer_input_source_select(timer_channel_input_enum timer_input);

/* Coder IO configuration functions */
/* select Coder IO */
void syscfg_coder_io_select(uint32_t coder_io);

/* Ethercat configuration functions */
/* configure Ethercat bus timeout */
void syscfg_bus_timeout_config(uint32_t periph, ControlStatus enable);
/* set Ethercat internal EEPROM address */
void syscfg_esc_internal_eeprom_set(uint32_t size, uint32_t address);
/* select EtherCat external EEPROM */
void syscfg_esc_external_eeprom_sel(void);
/* enable Ethercat mii txshift pin strap */
void syscfg_esc_mii_txshift_pin_enable(void);
/* disable Ethercat mii txshift pin strap */
void syscfg_esc_mii_txshift_pin_disable(void);
/* set Ethercat rmii1 mode tx_shift and rmii0_shift */
void syscfg_esc_rmii0_mode_shift_set(uint32_t txshift0, uint32_t rmii0_shift0);
/* set Ethercat rmii1 mode tx_shift and rmii1_shift */
void syscfg_esc_rmii1_mode_shift_set(uint32_t txshift1, uint32_t rmii1_shift1);
/* select Ethercat linkactled output polarity */
void syscfg_esc_linkactled_pol_sel(uint32_t linkactled0, uint32_t linkactled1, uint32_t linkactled2);
/*select Ethercat lederr output polarity */
void syscfg_esc_lederr_pol_sel(uint32_t lederr);
/* select Ethercat ledrun output polarity */
void syscfg_esc_ledrun_pol_sel(uint32_t ledrun);
/* set Ethercat reset_out output polarity and count of clock cycles */
void syscfg_esc_resetout_set(uint32_t rstout_pol, uint32_t rstout_cnt);
/* select Ethercat linkactled output polarity */
void syscfg_esc_link_pol_sel(uint32_t link0, uint32_t link1, uint32_t link2);
/* select Ethercat mii or rmii */
void syscfg_esc_mii_rmii_sel(uint32_t mii_rmii_sel);
/* configure Ethercat SMPS_DRIVE's drive capability */
void syscfg_esc_smps_drive_config(uint32_t drive_cap);
/* set Ethercat port0 phy address offset */
void syscfg_esc_phyaddress_offset_set(uint32_t phyadd_offset_sel, uint32_t offset_value);

/* I/O compensation cell functions */
/* configure the I/O compensation cell */
void syscfg_io_compensation_config(uint32_t syscfg_cps);
/* enable I/O speed optimization, high-speed at low-voltage */
void syscfg_io_low_voltage_speed_optimization_enable(void);
/* disable I/O speed optimization, high-speed at low-voltage */
void syscfg_io_low_voltage_speed_optimization_disable(void);
/* set P/N MOS compensation value */
void syscfg_pnmos_compensation_code_set(uint32_t mos, uint32_t code);

/* secure and boot functions */
/* set secure SRAM size */
void syscfg_secure_sram_size_set(uint32_t size);
/* get secure SRAM size */
uint32_t syscfg_secure_sram_size_get(void);
/* get BOOT mode */
uint32_t syscfg_bootmode_get(void);

/* flag and interrupt functions */
/* enable SYSCFG interrupt */
void syscfg_interrupt_enable(uint32_t interrupt);
/* disable SYSCFG interrupt */
void syscfg_interrupt_disable(uint32_t interrupt);
/* get bus timeout flag status */
FlagStatus syscfg_bus_timeout_flag_get(uint32_t flag);
/* get compensation cell flags */
FlagStatus syscfg_compensation_flag_get(uint32_t cps_flag);
/* get ICACHE or DCACHE status */
uint32_t syscfg_cpu_cache_status_get(uint32_t cache, uint32_t status);
/* get brownout reset threshold level */
uint32_t syscfg_brownout_reset_threshold_level_get(void);

#endif /* GD32H77X_SYSCFG_H */
